In [1]:
In [1]:  # Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load =  "purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [2]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
#number of purchases
len(purchase_data)

780

In [4]:
# data specific to people
players_df = purchase_data[['Gender','SN','Age']]
players_df = players_df.drop_duplicates()
players_df.head()

  Gender             SN  Age
0   Male        Lisim78   20
1   Male    Lisovynya38   40
2   Male     Ithergue48   24
3   Male  Chamassasya86   24
4   Male      Iskosia90   23

In [5]:
#Total Number of Players
len(players_df)

576

In [6]:
#get the number of unique items
unique_count = purchase_data['Item ID'].unique()
unique_count
len(unique_count)

179

In [7]:
# get the vaerage price
average_price = purchase_data['Price'].mean()
average_price

3.0509871794871795

In [8]:
# Total revenue
sum_price = purchase_data['Price'].sum()
sum_price

2379.77

In [9]:
#create a data frame. Summary_df is a varibale name created 
summary_df = pd.DataFrame({'Number of Unique Items': len(unique_count),
                          'Average Price': average_price,
                           'Number of Purchases': len(purchase_data),
                           'Total Revenue': [sum_price]})
#the []in sum_price turned into a list
#Purchasing Analysis Total
summary_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [10]:
# get unique values of male and female. We will use the players details. value_counts is a panda language
players_totalgender = players_df['Gender'].value_counts()
players_totalgender

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [42]:
players_totalgenderpercentage = 100*players_totalgender/len(players_df)
players_totalgenderpercentage.round(2)

Male                     84.03
Female                   14.06
Other / Non-Disclosed     1.91
Name: Gender, dtype: float64

In [43]:
#create a dataframe
gender_data = pd.DataFrame({'Total Count': players_totalgender,
                           'Percentage of Players':players_totalgenderpercentage})
gender_data.round(2)
#Gender Demographics

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91

In [13]:
gender_average = purchase_data.groupby(['Gender']).mean()
gender_average = gender_average['Price']
gender_average

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [14]:
gender_sum = purchase_data.groupby(['Gender']).sum()
gender_sum = gender_sum['Price']
gender_sum

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [15]:
gender_count = purchase_data.groupby(['Gender']).count()
gender_count = gender_count['Price']
gender_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [16]:
average_totalperson = gender_sum/gender_data['Total Count']
average_totalperson

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [44]:
gender_df = pd.DataFrame({'Purchase Count':gender_count,
                         'Average Purchase Price': gender_average,
                         'Total Purchase Value':gender_sum,
                         'Average Total Purchase Per Person':average_totalperson})
gender_df.round(2)
#Purchasing Analysis Gender

,Purchase Count,Average Purchase Price,Total Purchase Value,Average Total Purchase Per Person
Gender,,,,
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

In [18]:
#Set up bins (categories of ages)
bins = [0,9.9,14.9,19.9,24.9,29.9,34.9,39.9,999]
labels = ['<10','10-14','15-19','20-24','25-29','30-34','35-39','40+']
players_df['Age Ranges'] = pd.cut(players_df['Age'],bins,labels = labels)
age_counts = players_df['Age Ranges'].value_counts()
age_counts

20-24    258
15-19    107
25-29     77
30-34     52
35-39     31
10-14     22
<10       17
40+       12
Name: Age Ranges, dtype: int64

In [19]:
age_percent = 100*age_counts/len(players_df)
age_percent

20-24    44.791667
15-19    18.576389
25-29    13.368056
30-34     9.027778
35-39     5.381944
10-14     3.819444
<10       2.951389
40+       2.083333
Name: Age Ranges, dtype: float64

In [20]:
bin_summary = pd.DataFrame({'Total Count': age_counts,
                           'Percentage of Players': age_percent})
#This below will arrange it by index (top to bottom etc)
bin_summary = bin_summary.sort_index()
bin_summary
#Age Demographics

       Total Count  Percentage of Players
<10             17               2.951389
10-14           22               3.819444
15-19          107              18.576389
20-24          258              44.791667
25-29           77              13.368056
30-34           52               9.027778
35-39           31               5.381944
40+             12               2.083333

In [21]:
purchase_data['Age Ranges'] = pd.cut(purchase_data['Age'],bins,labels = labels)
purchase_dataaverage = purchase_data.groupby(['Age Ranges']).mean()['Price']
purchase_dataaverage

Age Ranges
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [22]:
purchase_datacount = purchase_data.groupby(['Age Ranges']).count()['Price']
purchase_datacount

Age Ranges
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+       13
Name: Price, dtype: int64

In [23]:
purchase_datasum = purchase_data.groupby(['Age Ranges']).sum()['Price']
purchase_datasum

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        38.24
Name: Price, dtype: float64

In [24]:
purchase_dataaverageperson = purchase_datasum/bin_summary['Total Count']
purchase_dataaverageperson

Age Ranges
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
35-39    4.763548
40+      3.186667
dtype: float64

In [45]:
purchase_analysisage = pd.DataFrame({'Purchase Count':purchase_datacount,
                                    'Average Purchase Price':purchase_dataaverage,
                                    'Total Purchase Value': purchase_datasum,
                                    'Total Average Purchase Per Person':purchase_dataaverageperson})
purchase_analysisage.round(2)

,Purchase Count,Average Purchase Price,Total Purchase Value,Total Average Purchase Per Person
Age Ranges,,,,
<10,23,3.35,77.13,4.54
10-14,28,2.96,82.78,3.76
15-19,136,3.04,412.89,3.86
20-24,365,3.05,1114.06,4.32
25-29,101,2.90,293.00,3.81
30-34,73,2.93,214.00,4.12
35-39,41,3.60,147.67,4.76
40+,13,2.94,38.24,3.19

In [26]:
# Purchase total value
SN_datasum = purchase_data.groupby(['SN']).sum()['Price']
SN_datasum

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [27]:
SN_dataaverage = purchase_data.groupby(['SN']).mean()['Price']
SN_dataaverage

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [28]:
SN_datacount = purchase_data.groupby(['SN']).count()['Price']
SN_datacount

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Price, Length: 576, dtype: int64

In [29]:
summary_SN = pd.DataFrame({'Purchase Count':SN_datacount,
                          'Average Purchase Price':SN_dataaverage,
                          'Total Purchase Value':SN_datasum})
summary_SN = summary_SN.sort_values(['Total Purchase Value'],ascending=False)
summary_SN.head()
#Top Spenders

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [30]:
#retrieve columns Item ID, Item Name and Item Price by dropping the others
popular_items = purchase_data.drop(columns=['Purchase ID','SN','Age', 'Gender','Age Ranges'])
popular_items.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [31]:
purchase_data

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [32]:
#count number of rows that match each item name
#when we want to select colums we use []
# to list the columns Item ID, Item Name and Price. This Price is defined in popular items cell 30, not necessarily in the big purchase data
item_data = purchase_data[['Item ID', 'Item Name', 'Price']]
item_data.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [46]:
#item_namecount = popular_items.groupby(['Item Name', 'Item ID']).count()['Price']
#item_namecount
purchase_count = popular_items.groupby(["Item ID", "Item Name"]).count()["Price"]
average_item_price = popular_items.groupby(["Item ID", "Item Name"]).mean()["Price"]
total_purchase_value = popular_items.groupby(["Item ID", "Item Name"]).sum()["Price"]
popular_df = pd.DataFrame({
    "Purchase Count": purchase_count,
    "Item Price": average_item_price,
    "Total Purchase Value": total_purchase_value
})
popular_sorted_df = popular_df.sort_values("Purchase Count", ascending=False)
popular_sorted_df.head(5).round(2)
#Most popular items

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.61,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
145,Fiery Glass Crusader,9,4.58,41.22
132,Persuasion,9,3.22,28.99
108,"Extraction, Quickblade Of Trembling Hands",9,3.53,31.77

In [34]:
#item_idcount = popular_items.groupby(['Item ID']).count()['Price']
#item_idcount

In [35]:
#item_namesum = popular_items.groupby(['Item Name']).sum()['Price']
#item_namesum

In [36]:
#item_idsum = popular_items.groupby(['Item ID']).sum()['Price']
#item_idsum

In [39]:
purchase_count = popular_items.groupby(["Item ID", "Item Name"]).count()["Price"]
average_item_price = popular_items.groupby(["Item ID", "Item Name"]).mean()["Price"]
total_purchase_value = popular_items.groupby(["Item ID", "Item Name"]).sum()["Price"]
popular_df = pd.DataFrame({
    "Purchase Count": purchase_count,
    "Item Price": average_item_price,
    "Total Purchase Value": total_purchase_value
})
popular_sorted_df = popular_df.sort_values("Total Purchase Value", ascending=False)
popular_sorted_df.head(5).round(2)
#Most profitable items

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,4.614615,59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.230000,50.76
82,Nirvana,9,4.900000,44.10
145,Fiery Glass Crusader,9,4.580000,41.22
103,Singed Scalpel,8,4.350000,34.80